Revit 2024 API
AnalysisDisplayDeformedShapeSettings.ShowContourLines Property
 If true, show contour lines in the analysis display.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool ShowContourLines { get; set; }
Visual Basic
Public Property ShowContourLines As Boolean
	Get
	Set
Visual C++
public:
property bool ShowContourLines {
	bool get ();
	void set (bool value);
}
See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace